Revit 2026 API

# FamilyManagerMakeNonReporting Method

---

Set the reporting family parameter as a regular/driving parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void MakeNonReporting(
	FamilyParameter familyParameter
)
```
```vb
Public Sub MakeNonReporting (
	familyParameter As FamilyParameter
)
```
```cpp
public:
void MakeNonReporting(
	FamilyParameter^ familyParameter
)
```
```fsharp
member MakeNonReporting :
        familyParameter : FamilyParameter -> unit
```

#### Parameters

familyParameter FamilyParameter

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"familyParameter"-is . |
| InvalidOperationException | Thrown when attempting to make a parameter which is labeled to an arc length dimension non-reporting. |

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace